ehughes/rt_super_z/bringup/rt_super_b/mimxrt685audevk_monkey_pdm/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FULLDRIVE_EN 0x0100u   /*!<@brief Full drive enable */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PULLUP_EN 0x20u        /*!<@brief Enable pull-up function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_PUPD_EN 0x10u          /*!<@brief Enable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name FC0_RXD_SDA_MOSI_DATA (coord G4), JP40[2]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_DEBUG_UART_RXD_PERIPHERAL FLEXCOMM0           /*!<@brief Peripheral name */
#define BOARD_INITPINS_DEBUG_UART_RXD_SIGNAL RXD_SDA_MOSI_DATA       /*!<@brief Signal name */
#define BOARD_INITPINS_DEBUG_UART_RXD_PORT 0U                        /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DEBUG_UART_RXD_PIN 2U                         /*!<@brief PORT pin number */
#define BOARD_INITPINS_DEBUG_UART_RXD_PIN_MASK (1U << 2U)            /*!<@brief PORT pin mask */
                                                                     /* @} */

/*! @name FC0_TXD_SCL_MISO_WS (coord G2), J16[1]/U27[3]/U9[12]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_DEBUG_UART_TXD_PERIPHERAL FLEXCOMM0         /*!<@brief Peripheral name */
#define BOARD_INITPINS_DEBUG_UART_TXD_SIGNAL TXD_SCL_MISO_WS       /*!<@brief Signal name */
#define BOARD_INITPINS_DEBUG_UART_TXD_PORT 0U                      /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DEBUG_UART_TXD_PIN 1U                       /*!<@brief PORT pin number */
#define BOARD_INITPINS_DEBUG_UART_TXD_PIN_MASK (1U << 1U)          /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name SWO (coord L16), U7[12]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_SWO_PERIPHERAL SWD            /*!<@brief Peripheral name */
#define BOARD_INITPINS_SWO_SIGNAL SWO                /*!<@brief Signal name */
#define BOARD_INITPINS_SWO_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SWO_PIN 24U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SWO_PIN_MASK (1U << 24U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PDM_CLK01 (coord R1), JP44[2]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_PDM_CLK01_PERIPHERAL DMIC0          /*!<@brief Peripheral name */
#define BOARD_INITPINS_PDM_CLK01_SIGNAL CLK                /*!<@brief Signal name */
#define BOARD_INITPINS_PDM_CLK01_CHANNEL 0_1               /*!<@brief Signal channel */
#define BOARD_INITPINS_PDM_CLK01_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PDM_CLK01_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PDM_CLK01_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PDM_CLK23 (coord U1), J31[5]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_PDM_CLK23_PERIPHERAL DMIC0          /*!<@brief Peripheral name */
#define BOARD_INITPINS_PDM_CLK23_SIGNAL CLK                /*!<@brief Signal name */
#define BOARD_INITPINS_PDM_CLK23_CHANNEL 2_3               /*!<@brief Signal channel */
#define BOARD_INITPINS_PDM_CLK23_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PDM_CLK23_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PDM_CLK23_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PDM_CLK45 (coord R2), J31[7]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_PDM_CLK45_PERIPHERAL DMIC0          /*!<@brief Peripheral name */
#define BOARD_INITPINS_PDM_CLK45_SIGNAL CLK                /*!<@brief Signal name */
#define BOARD_INITPINS_PDM_CLK45_CHANNEL 4_5               /*!<@brief Signal channel */
#define BOARD_INITPINS_PDM_CLK45_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PDM_CLK45_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PDM_CLK45_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PDM_CLK67 (coord T2), JP35[2]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_PDM_CLK67_PERIPHERAL DMIC0          /*!<@brief Peripheral name */
#define BOARD_INITPINS_PDM_CLK67_SIGNAL CLK                /*!<@brief Signal name */
#define BOARD_INITPINS_PDM_CLK67_CHANNEL 6_7               /*!<@brief Signal channel */
#define BOARD_INITPINS_PDM_CLK67_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PDM_CLK67_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PDM_CLK67_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                           /* @} */

