ehughes/rt_super_z/bringup/rt_super_b/mimxrt685audevk_monkey_pdm/board/pin_mux.h
/*! @name PDM_DATA01 (coord U2), JP45[2]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_PDM_DATA01_PERIPHERAL DMIC0          /*!<@brief Peripheral name */
#define BOARD_INITPINS_PDM_DATA01_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITPINS_PDM_DATA01_CHANNEL 0_1               /*!<@brief Signal channel */
#define BOARD_INITPINS_PDM_DATA01_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PDM_DATA01_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PDM_DATA01_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PDM_DATA23 (coord R3), J31[6]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_PDM_DATA23_PERIPHERAL DMIC0          /*!<@brief Peripheral name */
#define BOARD_INITPINS_PDM_DATA23_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITPINS_PDM_DATA23_CHANNEL 2_3               /*!<@brief Signal channel */
#define BOARD_INITPINS_PDM_DATA23_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PDM_DATA23_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PDM_DATA23_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PDM_DATA45 (coord P3), J31[8]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_PDM_DATA45_PERIPHERAL DMIC0          /*!<@brief Peripheral name */
#define BOARD_INITPINS_PDM_DATA45_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITPINS_PDM_DATA45_CHANNEL 4_5               /*!<@brief Signal channel */
#define BOARD_INITPINS_PDM_DATA45_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PDM_DATA45_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PDM_DATA45_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PDM_DATA67 (coord P5), J31[10]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_PDM_DATA67_PERIPHERAL DMIC0          /*!<@brief Peripheral name */
#define BOARD_INITPINS_PDM_DATA67_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITPINS_PDM_DATA67_CHANNEL 6_7               /*!<@brief Signal channel */
#define BOARD_INITPINS_PDM_DATA67_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PDM_DATA67_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PDM_DATA67_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name I3C0_PUR (coord B6), J18[3]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_I3C0_PUR_PERIPHERAL I3C            /*!<@brief Peripheral name */
#define BOARD_INITPINS_I3C0_PUR_SIGNAL PUR                /*!<@brief Signal name */
#define BOARD_INITPINS_I3C0_PUR_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_I3C0_PUR_PIN 31U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_I3C0_PUR_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name I3C0_SCL (coord N17), J18[1]/U110[13]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_I3C0_SCL_PERIPHERAL I3C            /*!<@brief Peripheral name */
#define BOARD_INITPINS_I3C0_SCL_SIGNAL SCL                /*!<@brief Signal name */
#define BOARD_INITPINS_I3C0_SCL_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_I3C0_SCL_PIN 29U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_I3C0_SCL_PIN_MASK (1U << 29U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name I3C0_SDA (coord P16), J18[2]/U110[14]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_I3C0_SDA_PERIPHERAL I3C            /*!<@brief Peripheral name */
#define BOARD_INITPINS_I3C0_SDA_SIGNAL SDA                /*!<@brief Signal name */
#define BOARD_INITPINS_I3C0_SDA_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_I3C0_SDA_PIN 30U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_I3C0_SDA_PIN_MASK (1U << 30U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name FC2_SCK (coord A3), Q4[5]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_LED_GREEN_PERIPHERAL FLEXCOMM2      /*!<@brief Peripheral name */
#define BOARD_INITPINS_LED_GREEN_SIGNAL SCK                /*!<@brief Signal name */
#define BOARD_INITPINS_LED_GREEN_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LED_GREEN_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LED_GREEN_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name HS_SPI_MISO (coord M2), JP37[2]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_LDC_MISO_PERIPHERAL FLEXCOMM14     /*!<@brief Peripheral name */
#define BOARD_INITPINS_LDC_MISO_SIGNAL MISO               /*!<@brief Signal name */
#define BOARD_INITPINS_LDC_MISO_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LDC_MISO_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LDC_MISO_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name HS_SPI_MOSI (coord N1), JP38[2]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_LCD_MOSI_PERIPHERAL FLEXCOMM14              /*!<@brief Peripheral name */
#define BOARD_INITPINS_LCD_MOSI_SIGNAL MOSI                        /*!<@brief Signal name */
#define BOARD_INITPINS_LCD_MOSI_PORT 1U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LCD_MOSI_PIN 13U                            /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_MOSI_PIN_MASK (1U << 13U)               /*!<@brief PORT pin mask */
                                                                   /* @} */

