ehughes/rt_super_z/bringup/rt_super_b/mimxrt685audevk_monkey_pdm/board/pin_mux.h
/*! @name HS_SPI_SCK (coord L2), JP36[2]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_LCD_SCK_PERIPHERAL FLEXCOMM14     /*!<@brief Peripheral name */
#define BOARD_INITPINS_LCD_SCK_SIGNAL SCK                /*!<@brief Signal name */
#define BOARD_INITPINS_LCD_SCK_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LCD_SCK_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_SCK_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name FC5_RXD_SDA_MOSI_DATA (coord J16), JP41[2]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_ACC_INT_PERIPHERAL FLEXCOMM5           /*!<@brief Peripheral name */
#define BOARD_INITPINS_ACC_INT_SIGNAL RXD_SDA_MOSI_DATA       /*!<@brief Signal name */
#define BOARD_INITPINS_ACC_INT_PORT 1U                        /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ACC_INT_PIN 5U                         /*!<@brief PORT pin number */
#define BOARD_INITPINS_ACC_INT_PIN_MASK (1U << 5U)            /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PIO2_5 (coord U13), LCD_CMD_DATA
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_LCD_CMD_DATA_PERIPHERAL GPIO                    /*!<@brief Peripheral name */
#define BOARD_INITPINS_LCD_CMD_DATA_SIGNAL PIO2                        /*!<@brief Signal name */
#define BOARD_INITPINS_LCD_CMD_DATA_CHANNEL 5                          /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LCD_CMD_DATA_GPIO GPIO                          /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LCD_CMD_DATA_INIT_GPIO_VALUE 0U                 /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_LCD_CMD_DATA_GPIO_PIN_MASK (1U << 5U)           /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_LCD_CMD_DATA_PORT 2U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LCD_CMD_DATA_PIN 5U                             /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_CMD_DATA_PIN_MASK (1U << 5U)                /*!<@brief PORT pin mask */
                                                                       /* @} */

/*! @name PIO2_6 (coord U15), LCD_RST
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_LCD_RST_PERIPHERAL GPIO                    /*!<@brief Peripheral name */
#define BOARD_INITPINS_LCD_RST_SIGNAL PIO2                        /*!<@brief Signal name */
#define BOARD_INITPINS_LCD_RST_CHANNEL 6                          /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LCD_RST_GPIO GPIO                          /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LCD_RST_INIT_GPIO_VALUE 0U                 /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_LCD_RST_GPIO_PIN_MASK (1U << 6U)           /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_LCD_RST_PORT 2U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LCD_RST_PIN 6U                             /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_RST_PIN_MASK (1U << 6U)                /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PIO2_7 (coord U16), LCD_BL
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_LCD_BL_PERIPHERAL GPIO                    /*!<@brief Peripheral name */
#define BOARD_INITPINS_LCD_BL_SIGNAL PIO2                        /*!<@brief Signal name */
#define BOARD_INITPINS_LCD_BL_CHANNEL 7                          /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LCD_BL_GPIO GPIO                          /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LCD_BL_INIT_GPIO_VALUE 1U                 /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_LCD_BL_GPIO_PIN_MASK (1U << 7U)           /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_LCD_BL_PORT 2U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LCD_BL_PIN 7U                             /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_BL_PIN_MASK (1U << 7U)                /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PIO1_14 (coord N2), SPI_SSEL
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_SPI_SSEL_PERIPHERAL GPIO                    /*!<@brief Peripheral name */
#define BOARD_INITPINS_SPI_SSEL_SIGNAL PIO1                        /*!<@brief Signal name */
#define BOARD_INITPINS_SPI_SSEL_CHANNEL 14                         /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SPI_SSEL_GPIO GPIO                          /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SPI_SSEL_INIT_GPIO_VALUE 1U                 /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_SPI_SSEL_GPIO_PIN_MASK (1U << 14U)          /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_SPI_SSEL_PORT 1U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SPI_SSEL_PIN 14U                            /*!<@brief PORT pin number */
#define BOARD_INITPINS_SPI_SSEL_PIN_MASK (1U << 14U)               /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PIO0_26 (coord A2), TP5
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_TP5_PERIPHERAL GPIO                    /*!<@brief Peripheral name */
#define BOARD_INITPINS_TP5_SIGNAL PIO0                        /*!<@brief Signal name */
#define BOARD_INITPINS_TP5_CHANNEL 26                         /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_TP5_GPIO GPIO                          /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_TP5_INIT_GPIO_VALUE 0U                 /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_TP5_GPIO_PIN_MASK (1U << 26U)          /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_TP5_PORT 0U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_TP5_PIN 26U                            /*!<@brief PORT pin number */
#define BOARD_INITPINS_TP5_PIN_MASK (1U << 26U)               /*!<@brief PORT pin mask */
                                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M33 */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
